app/mailers/user_mailer.rb

    def order_email(user)
      @user = user
      orders = Order.where(user_id: @user)
      @items = []
      orders.each do |ord|
      	assoc = AssociateOrderItem.find_by(order_id: ord.id)
      	@items.push(Item.find(assoc.item_id))
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT  "associate_order_items".* FROM "associate_order_items" WHERE "associate_order_items"."order_id" = $1 LIMIT $2  [["order_id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]