app/controllers/cart_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."item_id" = $1 LIMIT $2  [["item_id", 2], ["LIMIT", 1]]
INSERT INTO "associate_item_carts" ("item_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 2], ["cart_id", 1], ["created_at", "2018-05-30 09:42:51.862340"], ["updated_at", "2018-05-30 09:42:51.862340"]]
---
  def create
  	if user_signed_in?
  		item = Item.find(params[:id])

  		@cart = Cart.find_by(user_id: current_user.id)
  		associations = AssociateItemCart.find_by(item_id: item.id)

  		if @cart != nil
  			if associations == nil
  				assoc = AssociateItemCart.new
		  		assoc.cart = @cart
		  		assoc.item = item

		  		assoc.save