app/controllers/charges_controller.rb

	def new
		if user_signed_in?
    	@cart = Cart.find_by(user_id: current_user.id)
    	if @cart != nil
	  		associations = AssociateItemCart.where(cart_id: @cart.id)
	  		@items = []
	  		associations.each do |a|
	  			@items.push(Item.find(a.item_id))
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

	def create
	  # Amount in cents
	  @amount = 500

	  customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :source  => params[:stripeToken]
	  )

	  charge = Stripe::Charge.create(
	    :customer    => customer.id,
	    :amount      => @amount,
	    :description => 'Rails Stripe customer',
	    :currency    => 'usd'
	  )

	  order = Order.new
  	order.user = current_user

  	assoc1 = AssociateOrderItem.new
  	assoc1.order = order

  	cart = Cart.find_by(user_id: current_user.id)
  	assoc2 = AssociateItemCart.where(cart_id: cart.id)

  	assoc2.each do |a|
  		item = Item.find(a.item_id)
  		assoc1.item = item
  		assoc1.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "associate_order_items" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 2], ["item_id", 9], ["created_at", "2018-05-31 13:18:48.757906"], ["updated_at", "2018-05-31 13:18:48.757906"]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2018-05-31 13:18:48.715848"], ["updated_at", "2018-05-31 13:18:48.715848"]]

  		a.destroy
  	end

  	cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]