app/controllers/home_controller.rb

  def index
    @cats = Item.all
    if user_signed_in?
    	@cart = Cart.find_by(user_id: current_user.id)
    	if @cart != nil
	  		associations = AssociateItemCart.where(cart_id: @cart.id)
	  		@items = []
	  		associations.each do |a|
	  			@items.push(Item.find(a.item_id))
	  		end
    	else
    		@cart = Cart.new
    		current_user.cart = @cart
    		@cart.save
---
SELECT "items".* FROM "items"
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2018-05-30 12:51:13.285292"], ["updated_at", "2018-05-30 12:51:13.285292"]]

	def show
  	@cat = Item.find(params[:id])
  	if user_signed_in?
    	@cart = Cart.find_by(user_id: current_user.id)
  		associations = AssociateItemCart.where(cart_id: @cart.id)
  		@items = []
  		associations.each do |a|
  			@items.push(Item.find(a.item_id))
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def cart
  	if user_signed_in?
  		@cart = Cart.find_by(user_id: current_user.id)
  		if @cart != nil
	  		associations = AssociateItemCart.where(cart_id: @cart.id)
	  		@items = []
	  		associations.each do |a|
	  			@items.push(Item.find(a.item_id))
	  		end
  			render "cart"
    	else
    		@cart = Cart.new
    		current_user.cart = @cart
    		@cart.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 1]]
SELECT "associate_item_carts".* FROM "associate_item_carts" WHERE "associate_item_carts"."cart_id" = $1  [["cart_id", 3]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2018-05-31 13:35:38.145743"], ["updated_at", "2018-05-31 13:35:38.145743"]]